<a href="https://colab.research.google.com/github/HAN-GEONHUI/test/blob/t_academy_%EC%88%98%EC%97%85_pandas/16_pandas_mysql(240902).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
!pip install pymysql
#--> 터미널에서 관리자 권한으로 pip install pymysql
#--> 주피터 노트북세에서 하려면 !pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.1.1-py3-none-any.whl.metadata (4.4 kB)
Downloading PyMySQL-1.1.1-py3-none-any.whl (44 kB)
   ---------------------------------------- 0.0/45.0 kB ? eta -:--:--
   ------------------ --------------------- 20.5/45.0 kB 320.0 kB/s eta 0:00:01
   ---------------------------------------- 45.0/45.0 kB 551.3 kB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.1

In [ ]:
#위의 패키지 설치는 한 번 했으면 업데이트할 이 없고 더 이상 실행 안해도 됨!

In [ ]:
import pymysql

In [ ]:
#접속 관련 연결 설정!
mysql_con = pymysql.connect(
    user = "root",#접속할 mysql에 대한 계정 이름
    passwd = "qwert12345",#계정에 대한 비번
    host = "127.0.0.1", #내가 접속한 mysql서버의 ,ip주소. 이경우는 내 pc여서 자체로
    db = "sqldb", #mysql에 있는 여러 db 중에서 접속하려는 데이터베이스
    charset = "utf8" # 데이터에 한글이 있을 때, 파이썬 쪽에서 처리하는 기준!
)

In [ ]:
#연결
my_cursor =mysql_con.cursor(pymysql.cursors.DictCursor)

In [ ]:
#요청할 쿼리문을 문자열로 작성!-->;까지 포함해서  작성!
sql = "select * from usertbl;"

In [ ]:
#실제 요청
my_cursor.execute(sql)

10

In [ ]:
# 결과 중에서 몇 개를 가지고 올지 지정을 할 수 있다..
result = my_cursor.fetchall()

In [ ]:
result

[{'userID': 'BBK',
  'name': '바비킴',
  'birthYear': 1973,
  'addr': '서울',
  'mobile1': '010',
  'mobile2': '0000000',
  'height': 176,
  'mDate': datetime.date(2013, 5, 5)},
 {'userID': 'EJW',
  'name': '은지원',
  'birthYear': 1972,
  'addr': '경북',
  'mobile1': '011',
  'mobile2': '8888888',
  'height': 174,
  'mDate': datetime.date(2014, 3, 3)},
 {'userID': 'JKW',
  'name': '조관우',
  'birthYear': 1965,
  'addr': '경기',
  'mobile1': '018',
  'mobile2': '9999999',
  'height': 172,
  'mDate': datetime.date(2010, 10, 10)},
 {'userID': 'JYP',
  'name': '조용필',
  'birthYear': 1950,
  'addr': '경기',
  'mobile1': '011',
  'mobile2': '4444444',
  'height': 166,
  'mDate': datetime.date(2009, 4, 4)},
 {'userID': 'KBS',
  'name': '김범수',
  'birthYear': 1979,
  'addr': '경남',
  'mobile1': '011',
  'mobile2': '2222222',
  'height': 173,
  'mDate': datetime.date(2012, 4, 4)},
 {'userID': 'KKH',
  'name': '김경호',
  'birthYear': 1971,
  'addr': '전남',
  'mobile1': '019',
  'mobile2': '3333333',
  'height': 177,
  'mDate': datetime.date(2007, 7, 7)},
 {'userID': 'LJB',
  'name': '임재범',
  'birthYear': 1963,
  'addr': '서울',
  'mobile1': '016',
  'mobile2': '6666666',
  'height': 182,
  'mDate': datetime.date(2009, 9, 9)},
 {'userID': 'LSG',
  'name': '이승기',
  'birthYear': 1987,
  'addr': '서울',
  'mobile1': '011',
  'mobile2': '1111111',
  'height': 182,
  'mDate': datetime.date(2008, 8, 8)},
 {'userID': 'SSK',
  'name': '성시경',
  'birthYear': 1979,
  'addr': '서울',
  'mobile1': None,
  'mobile2': None,
  'height': 186,
  'mDate': datetime.date(2013, 12, 12)},
 {'userID': 'YJS',
  'name': '윤종신',
  'birthYear': 1969,
  'addr': '경남',
  'mobile1': None,
  'mobile2': None,
  'height': 170,
  'mDate': datetime.date(2005, 5, 5)}]

In [ ]:
import pandas as pd

In [ ]:
result_df=pd.DataFrame(result)
result_df

  userID name  birthYear addr mobile1  mobile2  height       mDate
0    BBK  바비킴       1973   서울     010  0000000     176  2013-05-05
1    EJW  은지원       1972   경북     011  8888888     174  2014-03-03
2    JKW  조관우       1965   경기     018  9999999     172  2010-10-10
3    JYP  조용필       1950   경기     011  4444444     166  2009-04-04
4    KBS  김범수       1979   경남     011  2222222     173  2012-04-04
5    KKH  김경호       1971   전남     019  3333333     177  2007-07-07
6    LJB  임재범       1963   서울     016  6666666     182  2009-09-09
7    LSG  이승기       1987   서울     011  1111111     182  2008-08-08
8    SSK  성시경       1979   서울    None     None     186  2013-12-12
9    YJS  윤종신       1969   경남    None     None     170  2005-05-05

In [ ]:
result_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   userID     10 non-null     object
 1   name       10 non-null     object
 2   birthYear  10 non-null     int64
 3   addr       10 non-null     object
 4   mobile1    8 non-null      object
 5   mobile2    8 non-null      object
 6   height     10 non-null     int64
 7   mDate      10 non-null     object
dtypes: int64(2), object(6)
memory usage: 772.0+ bytes

In [ ]:
#mysql 상에서 userID 컬럼이 PK역할을 했었다고 하면
#--> DataFrame에서는 index가 가로줄이다.
result_df.set_index("userID")

       name  birthYear addr mobile1  mobile2  height       mDate
userID
BBK     바비킴       1973   서울     010  0000000     176  2013-05-05
EJW     은지원       1972   경북     011  8888888     174  2014-03-03
JKW     조관우       1965   경기     018  9999999     172  2010-10-10
JYP     조용필       1950   경기     011  4444444     166  2009-04-04
KBS     김범수       1979   경남     011  2222222     173  2012-04-04
KKH     김경호       1971   전남     019  3333333     177  2007-07-07
LJB     임재범       1963   서울     016  6666666     182  2009-09-09
LSG     이승기       1987   서울     011  1111111     182  2008-08-08
SSK     성시경       1979   서울    None     None     186  2013-12-12
YJS     윤종신       1969   경남    None     None     170  2005-05-05